# shell
brew "fish"
brew "bash"
brew "shellcheck"

# programs
brew "tmux"
brew "neovim"
brew "vim"
brew "git"
brew "fzf"
brew "curl"
brew "htop"
brew "nnn"
brew "links"
brew "pass"

# mail
brew "neomutt"
brew "isync"
brew "msmtp"

# utilities
brew "ripgrep"
brew "trash-cli"
brew "hub"
brew "awscli"
brew "ffsend"
brew "asciinema"
brew "xsv"
brew "pastel"
brew "youtube-dl"
brew "ffmpeg"
brew "imageoptim-cli"
brew "tldr"

# programming languages
brew "rust"
brew "gcc"
brew "node"
brew "yarn"
brew "python"

# gnu coreutils
if OS.mac?
    brew "coreutils"
    brew "findutils"
    brew "gnu-tar"
    brew "gnu-sed"
    brew "gawk"
    brew "gnutls"
    brew "gnu-indent"
    brew "gnu-getopt"
    brew "grep"
end

# gui (MacOS only)
tap "homebrew/cask-versions"
cask "alacritty"
cask "firefox-developer-edition"
cask "alfred"
cask "pock"
cask "macs-fan-control"
# karabiner elements
# Magnet
